app/controllers/api/v1/lists_controller.rb

SELECT "lists".* FROM "lists" ORDER BY "lists"."id" ASC
---
    def index
      @lists = List.order(:id)

INSERT INTO "lists" ("title", "excerpt", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Twilight's Adventure"], ["excerpt", "Twilight and Fluttershy went for a walk in the forest."], ["created_at", "2019-06-18 17:42:56.765358"], ["updated_at", "2019-06-18 17:42:56.765358"]]
---
    def create
      @list = List.new(list_params)

      if @list.save

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 3]]
---
    def destroy
      @list.destroy